In [1]:
import pandas as pd
import numpy as np
from pylab import *
import matplotlib as plt
import seaborn as sns

# pandas基础学习

---

## 创建pandas中的对象

包括`Series`和`DataFrame`两种主要的类型

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])    #用np.nan来表示N/A值.
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range('20130101', periods=6)    #periods用来设置总数
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
dates2 = pd.date_range('20130101', periods=7)    #periods用来设置总数
dates2

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06', '2013-01-07'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))    #用随机数产生了6行4列的数据, 索引为dates, 数据标识(表头)为abcd
df

                   A         B         C         D
2013-01-01 -0.162316  0.125512  0.642859 -1.706161
2013-01-02  0.300310  0.147073  0.019576  1.520991
2013-01-03 -1.246548 -0.736286  0.755837 -0.834636
2013-01-04 -0.872029  2.654093 -2.348705 -0.577967
2013-01-05 -2.295810 -0.643991  1.008949 -0.160412
2013-01-06  1.495758  0.395178  0.375293 -0.370660

In [6]:
df2 = pd.DataFrame({ 'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'), 
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]), 
                    'F' : 'foo' })
# 利用字典来创造DataFrame, 其中的字典标签会自动转换为数据标识. 索引为空
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [7]:
df3 = pd.DataFrame({ 'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'), 
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]), 
                    'F' : 'foo' },index = [1,2,3,4])
# 利用字典来创造DataFrame, 其中的字典标签会自动转换为数据标识. 索引可以指定
df3

     A          B    C  D      E    F
1  1.0 2013-01-02  1.0  3   test  foo
2  1.0 2013-01-02  1.0  3  train  foo
3  1.0 2013-01-02  1.0  3   test  foo
4  1.0 2013-01-02  NaN  3  train  foo

In [8]:
df3.count

<bound method DataFrame.count of      A          B    C  D      E    F
1  1.0 2013-01-02  1.0  3   test  foo
2  1.0 2013-01-02  1.0  3  train  foo
3  1.0 2013-01-02  1.0  3   test  foo
4  1.0 2013-01-02  NaN  3  train  foo>

## 查阅数据

### 基本

In [9]:
df.head(2)    #前面若干行数据,可以设置参数, 默认为5行

                   A         B         C         D
2013-01-01 -0.162316  0.125512  0.642859 -1.706161
2013-01-02  0.300310  0.147073  0.019576  1.520991

In [10]:
df.tail(2)    #与head相似,最后若干行数据, 默认为5行

                   A         B         C         D
2013-01-05 -2.295810 -0.643991  1.008949 -0.160412
2013-01-06  1.495758  0.395178  0.375293 -0.370660

### 索引和标识(index, columns)

In [11]:
df.index    #索引列表

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df.columns    #标识列表

Index(['A', 'B', 'C', 'D'], dtype='object')

### 快速查阅

In [13]:
df.describe()    #给出了主要的一些统计结果

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.463439  0.323597  0.075635 -0.354808
std    1.315312  1.230147  1.234978  1.064223
min   -2.295810 -0.736286 -2.348705 -1.706161
25%   -1.152919 -0.451615  0.108506 -0.770469
50%   -0.517173  0.136293  0.509076 -0.474314
75%    0.184653  0.333152  0.727592 -0.212974
max    1.495758  2.654093  1.008949  1.520991

In [14]:
df2.describe()    #对于非数值型, 许多统计量是没法使用的

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

### 排列

In [15]:
df.T    #转置,对df本身没有影响

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.162316    0.300310   -1.246548   -0.872029   -2.295810    1.495758
B    0.125512    0.147073   -0.736286    2.654093   -0.643991    0.395178
C    0.642859    0.019576    0.755837   -2.348705    1.008949    0.375293
D   -1.706161    1.520991   -0.834636   -0.577967   -0.160412   -0.370660

In [16]:
df

                   A         B         C         D
2013-01-01 -0.162316  0.125512  0.642859 -1.706161
2013-01-02  0.300310  0.147073  0.019576  1.520991
2013-01-03 -1.246548 -0.736286  0.755837 -0.834636
2013-01-04 -0.872029  2.654093 -2.348705 -0.577967
2013-01-05 -2.295810 -0.643991  1.008949 -0.160412
2013-01-06  1.495758  0.395178  0.375293 -0.370660

In [17]:
df.sort_values(by='A')    #依据值进行排列

                   A         B         C         D
2013-01-05 -2.295810 -0.643991  1.008949 -0.160412
2013-01-03 -1.246548 -0.736286  0.755837 -0.834636
2013-01-04 -0.872029  2.654093 -2.348705 -0.577967
2013-01-01 -0.162316  0.125512  0.642859 -1.706161
2013-01-02  0.300310  0.147073  0.019576  1.520991
2013-01-06  1.495758  0.395178  0.375293 -0.370660

In [18]:
df.sort_index(axis=1, ascending=False)    #axis=1设置为横轴, 默认设置为0(纵轴), ascending设置为正序和逆序

                   D         C         B         A
2013-01-01 -1.706161  0.642859  0.125512 -0.162316
2013-01-02  1.520991  0.019576  0.147073  0.300310
2013-01-03 -0.834636  0.755837 -0.736286 -1.246548
2013-01-04 -0.577967 -2.348705  2.654093 -0.872029
2013-01-05 -0.160412  1.008949 -0.643991 -2.295810
2013-01-06 -0.370660  0.375293  0.395178  1.495758

In [19]:
df.sort_index(axis=0, ascending=False)    #axis=1设置为横轴, 默认设置为0(纵轴), ascending设置为正序和逆序

                   A         B         C         D
2013-01-06  1.495758  0.395178  0.375293 -0.370660
2013-01-05 -2.295810 -0.643991  1.008949 -0.160412
2013-01-04 -0.872029  2.654093 -2.348705 -0.577967
2013-01-03 -1.246548 -0.736286  0.755837 -0.834636
2013-01-02  0.300310  0.147073  0.019576  1.520991
2013-01-01 -0.162316  0.125512  0.642859 -1.706161

## 选择数据

In [20]:
df.A    #与下面的方式是等价的

2013-01-01   -0.162316
2013-01-02    0.300310
2013-01-03   -1.246548
2013-01-04   -0.872029
2013-01-05   -2.295810
2013-01-06    1.495758
Freq: D, Name: A, dtype: float64

In [21]:
df['A']

2013-01-01   -0.162316
2013-01-02    0.300310
2013-01-03   -1.246548
2013-01-04   -0.872029
2013-01-05   -2.295810
2013-01-06    1.495758
Freq: D, Name: A, dtype: float64

In [22]:
df[0:3]    #选取若干行,0开始,3为总行数,并不是1-3行

                   A         B         C         D
2013-01-01 -0.162316  0.125512  0.642859 -1.706161
2013-01-02  0.300310  0.147073  0.019576  1.520991
2013-01-03 -1.246548 -0.736286  0.755837 -0.834636

In [23]:
df['2013-01-01':'2013-01-04']    #可以直接给定index来指定

                   A         B         C         D
2013-01-01 -0.162316  0.125512  0.642859 -1.706161
2013-01-02  0.300310  0.147073  0.019576  1.520991
2013-01-03 -1.246548 -0.736286  0.755837 -0.834636
2013-01-04 -0.872029  2.654093 -2.348705 -0.577967

In [24]:
df.loc[dates[0]]    #这里的dates是index, 也就是dates这个数组的第一项

A   -0.162316
B    0.125512
C    0.642859
D   -1.706161
Name: 2013-01-01 00:00:00, dtype: float64

In [27]:
#df.loc[A[0]]    #可见,必须是在前文定义过index

In [28]:
df.loc['2013-01-01':'2013-01-03',['A','D']]    #loc首先指定的是行, 行是连续的量. 随后制定列. 列是可选的, 并且可以是离散的

                   A         D
2013-01-01 -0.162316 -1.706161
2013-01-02  0.300310  1.520991
2013-01-03 -1.246548 -0.834636

In [30]:
#df.loc[0:3]    #loc必须制定的是index和columns中的名称, 制定数字是步行的

In [31]:
df.iloc[0:3]   #数字需要用iloc来指定

                   A         B         C         D
2013-01-01 -0.162316  0.125512  0.642859 -1.706161
2013-01-02  0.300310  0.147073  0.019576  1.520991
2013-01-03 -1.246548 -0.736286  0.755837 -0.834636

In [32]:
df.loc['2013-01-01':'2013-01-03','A':'D']    #如果不把指定的内容放进[](作为数组), 那么可以用:指定区间

                   A         B         C         D
2013-01-01 -0.162316  0.125512  0.642859 -1.706161
2013-01-02  0.300310  0.147073  0.019576  1.520991
2013-01-03 -1.246548 -0.736286  0.755837 -0.834636

In [33]:
df.iloc[:,0:2]    #用iloc指定行列

                   A         B
2013-01-01 -0.162316  0.125512
2013-01-02  0.300310  0.147073
2013-01-03 -1.246548 -0.736286
2013-01-04 -0.872029  2.654093
2013-01-05 -2.295810 -0.643991
2013-01-06  1.495758  0.395178

In [34]:
df.iloc[[1,2,4],[0,2]]    #iloc还可以挑选特定行列

                   A         C
2013-01-02  0.300310  0.019576
2013-01-03 -1.246548  0.755837
2013-01-05 -2.295810  1.008949

In [35]:
df.iloc[1,1]    #直接指定位置

0.14707322338722573

In [36]:
df[df['A']>0]   #选择数据可以加入运算符

                   A         B         C         D
2013-01-02  0.300310  0.147073  0.019576  1.520991
2013-01-06  1.495758  0.395178  0.375293 -0.370660

## 设置数据(操作数据)
结合上文的选择数据, 可以对选定的数据直接进行赋值的操作

In [37]:
df.iloc[:,1] = 1    #1指定的是第二列
df

                   A  B         C         D
2013-01-01 -0.162316  1  0.642859 -1.706161
2013-01-02  0.300310  1  0.019576  1.520991
2013-01-03 -1.246548  1  0.755837 -0.834636
2013-01-04 -0.872029  1 -2.348705 -0.577967
2013-01-05 -2.295810  1  1.008949 -0.160412
2013-01-06  1.495758  1  0.375293 -0.370660

## 缺失值处理

In [38]:
df3['F'] = np.nan
df3

     A          B    C  D      E   F
1  1.0 2013-01-02  1.0  3   test NaN
2  1.0 2013-01-02  1.0  3  train NaN
3  1.0 2013-01-02  1.0  3   test NaN
4  1.0 2013-01-02  NaN  3  train NaN

In [39]:
df4 = df3.dropna(axis = 1,how='any')    #丢弃na的数据, 方式为any, 则任何有na的数据被丢弃. 方式为all, 则全部为na的数据才被丢弃
df4

     A          B  D      E
1  1.0 2013-01-02  3   test
2  1.0 2013-01-02  3  train
3  1.0 2013-01-02  3   test
4  1.0 2013-01-02  3  train

In [40]:
df5 = df3.dropna(axis = 1, how='all')    #对比上文, C列没有被删除
df5

     A          B    C  D      E
1  1.0 2013-01-02  1.0  3   test
2  1.0 2013-01-02  1.0  3  train
3  1.0 2013-01-02  1.0  3   test
4  1.0 2013-01-02  NaN  3  train

In [42]:
#df5.fillna(value=5)    #fillna还不能实现
#pd.isna(df5)

## 运算

In [43]:
df.mean()    #均值, 按列计算

A   -0.463439
B    1.000000
C    0.075635
D   -0.354808
dtype: float64

In [44]:
df.mean(1)    #计算行的均值

2013-01-01   -0.056405
2013-01-02    0.710219
2013-01-03   -0.081337
2013-01-04   -0.699675
2013-01-05   -0.111818
2013-01-06    0.625098
Freq: D, dtype: float64

In [45]:
df.mean(axis = 1)    #可见上面的1与axis=1是等价的

2013-01-01   -0.056405
2013-01-02    0.710219
2013-01-03   -0.081337
2013-01-04   -0.699675
2013-01-05   -0.111818
2013-01-06    0.625098
Freq: D, dtype: float64

In [46]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(1)   #shif将数据移动了若干各位置
s

2013-01-01    NaN
2013-01-02    1.0
2013-01-03    3.0
2013-01-04    5.0
2013-01-05    NaN
2013-01-06    6.0
Freq: D, dtype: float64

In [47]:
print(df)
df.sub(s, axis='index')   #减去了s

                   A  B         C         D
2013-01-01 -0.162316  1  0.642859 -1.706161
2013-01-02  0.300310  1  0.019576  1.520991
2013-01-03 -1.246548  1  0.755837 -0.834636
2013-01-04 -0.872029  1 -2.348705 -0.577967
2013-01-05 -2.295810  1  1.008949 -0.160412
2013-01-06  1.495758  1  0.375293 -0.370660

                   A    B         C         D
2013-01-01       NaN  NaN       NaN       NaN
2013-01-02 -0.699690  0.0 -0.980424  0.520991
2013-01-03 -4.246548 -2.0 -2.244163 -3.834636
2013-01-04 -5.872029 -4.0 -7.348705 -5.577967
2013-01-05       NaN  NaN       NaN       NaN
2013-01-06 -4.504242 -5.0 -5.624707 -6.370660

In [48]:
df.add(s, axis='index')    #增加了s, 对每一列进行操作, 索引通过index

                   A    B         C         D
2013-01-01       NaN  NaN       NaN       NaN
2013-01-02  1.300310  2.0  1.019576  2.520991
2013-01-03  1.753452  4.0  3.755837  2.165364
2013-01-04  4.127971  6.0  2.651295  4.422033
2013-01-05       NaN  NaN       NaN       NaN
2013-01-06  7.495758  7.0  6.375293  5.629340

In [49]:
df.apply(np.cumsum)    #这里的np.cumsun是向上累计的算法

                   A  B         C         D
2013-01-01 -0.162316  1  0.642859 -1.706161
2013-01-02  0.137994  2  0.662435 -0.185170
2013-01-03 -1.108554  3  1.418272 -1.019806
2013-01-04 -1.980583  4 -0.930434 -1.597774
2013-01-05 -4.276393  5  0.078516 -1.758186
2013-01-06 -2.780635  6  0.453809 -2.128846

In [50]:
df.apply(lambda x: x.max() - x.min())    #对列的值进行运算, 运算方法为最大值-最小值

A    3.791568
B    0.000000
C    3.357655
D    3.227152
dtype: float64

In [51]:
df.apply(lambda y: y.max() - y.min(),axis = 1)    #赋值axis =1 则按行计算, 同时, 变量名称是可以自行设置的

2013-01-01    2.706161
2013-01-02    1.501415
2013-01-03    2.246548
2013-01-04    3.348705
2013-01-05    3.304759
2013-01-06    1.866418
Freq: D, dtype: float64

In [52]:
s = pd.Series(np.random.randint(0, 7, size=10))
s.value_counts()    #values_coounts()只能用于Series

1    4
0    3
4    1
3    1
2    1
dtype: int64

In [53]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s.str.lower()    #大写转小写

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [54]:
s.str.upper()   #转了大写

0       A
1       B
2       C
3    AABA
4    BACA
5     NaN
6    CABA
7     DOG
8     CAT
dtype: object

## 分割与组合

In [55]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  1.298020 -0.789639  1.034383 -0.500089
1 -1.007164 -0.690577  0.758005  0.530112
2  0.815940 -0.866441 -0.664911  0.349468
3 -1.089498  0.956225  0.148218 -1.327554
4  1.389814  0.988470 -0.275805  0.979070
5 -0.078461 -0.866949 -0.938714  0.927515
6  0.099040 -1.105885  0.297252  1.835733
7 -2.325532  0.376729 -0.499729  0.019013
8  0.624154  0.484012 -1.113938 -2.432626
9  0.361524  0.529894 -1.085073  0.525043

In [56]:
pieces = [df[:3], df[3:7], df[6:]]  # 切片的操作可以重叠区域, 如6行的数据
pieces

[          0         1         2         3
 0  1.298020 -0.789639  1.034383 -0.500089
 1 -1.007164 -0.690577  0.758005  0.530112
 2  0.815940 -0.866441 -0.664911  0.349468,
           0         1         2         3
 3 -1.089498  0.956225  0.148218 -1.327554
 4  1.389814  0.988470 -0.275805  0.979070
 5 -0.078461 -0.866949 -0.938714  0.927515
 6  0.099040 -1.105885  0.297252  1.835733,
           0         1         2         3
 6  0.099040 -1.105885  0.297252  1.835733
 7 -2.325532  0.376729 -0.499729  0.019013
 8  0.624154  0.484012 -1.113938 -2.432626
 9  0.361524  0.529894 -1.085073  0.525043]

In [57]:
pieces[0]    #切片内的每个部分都是一个DataFrame

          0         1         2         3
0  1.298020 -0.789639  1.034383 -0.500089
1 -1.007164 -0.690577  0.758005  0.530112
2  0.815940 -0.866441 -0.664911  0.349468

In [58]:
pd.concat(pieces)

          0         1         2         3
0  1.298020 -0.789639  1.034383 -0.500089
1 -1.007164 -0.690577  0.758005  0.530112
2  0.815940 -0.866441 -0.664911  0.349468
3 -1.089498  0.956225  0.148218 -1.327554
4  1.389814  0.988470 -0.275805  0.979070
5 -0.078461 -0.866949 -0.938714  0.927515
6  0.099040 -1.105885  0.297252  1.835733
6  0.099040 -1.105885  0.297252  1.835733
7 -2.325532  0.376729 -0.499729  0.019013
8  0.624154  0.484012 -1.113938 -2.432626
9  0.361524  0.529894 -1.085073  0.525043

In [59]:
left = pd.DataFrame({'key': ['faa', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'fbb'], 'rval': [4, 5]})
print (left)
print (right)

   key  lval
0  faa     1
1  foo     2
   key  rval
0  foo     4
1  fbb     5

In [60]:
a1 = pd.merge(left, right, on='key')    #组合, 对指定的'key'上, 查找对应的数据, 进行组合, 不一致的内容被舍弃
a1

   key  lval  rval
0  foo     2     4

这里可以见, 采用`merga`的方法组合2个表的时候, key最好是一个唯一值

In [61]:
s = df.iloc[1]
l = df.iloc[:,1]
df.append(s,ignore_index=True)

           0         1         2         3
0   1.298020 -0.789639  1.034383 -0.500089
1  -1.007164 -0.690577  0.758005  0.530112
2   0.815940 -0.866441 -0.664911  0.349468
3  -1.089498  0.956225  0.148218 -1.327554
4   1.389814  0.988470 -0.275805  0.979070
5  -0.078461 -0.866949 -0.938714  0.927515
6   0.099040 -1.105885  0.297252  1.835733
7  -2.325532  0.376729 -0.499729  0.019013
8   0.624154  0.484012 -1.113938 -2.432626
9   0.361524  0.529894 -1.085073  0.525043
10 -1.007164 -0.690577  0.758005  0.530112

In [62]:
df2.iloc[0:2,0]=2
df2

     A          B    C  D      E    F
0  2.0 2013-01-02  1.0  3   test  foo
1  2.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [63]:
df2.groupby('E')    #groupby是依据某一列数据进行分组, 分组之后, 需要进一步指定计算方式

In [64]:
df2.groupby('E').sum()

         A    C  D
E
test   3.0  2.0  6
train  3.0  2.0  6

In [65]:
df2.groupby('E').count()

       A  B  C  D  F
E
test   2  2  2  2  2
train  2  2  2  2  2

In [66]:
df2.groupby('E').mean()

         A    C  D
E
test   1.5  1.0  3
train  1.5  1.0  3

In [67]:
df2.groupby(['A','E']).sum()    #可以指定数组进行分组处理

             C  D
A   E
1.0 test   1.0  3
    train  1.0  3
2.0 test   1.0  3
    train  1.0  3

## 重构
对于数据内容的重新组织

In [74]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'], ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]))
tuples    #这里的list和zip的方法都需要进一步的了解

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [75]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])    #定义了一个复合index, 用的是上面的数组
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])    #DataFrame会依据数据的不同来重新组合
df

                     A         B
first second
bar   one     0.525065  0.463145
      two     0.077393 -0.925633
baz   one     0.204906  1.746510
      two    -0.779591  1.391270
foo   one    -0.173879 -1.757532
      two    -0.920432  0.926281
qux   one    -2.034043  0.168328
      two     0.513572  1.057075

In [76]:
stacked = df.stack()
stacked

first  second
bar    one     A    0.525065
               B    0.463145
       two     A    0.077393
               B   -0.925633
baz    one     A    0.204906
               B    1.746510
       two     A   -0.779591
               B    1.391270
foo    one     A   -0.173879
               B   -1.757532
       two     A   -0.920432
               B    0.926281
qux    one     A   -2.034043
               B    0.168328
       two     A    0.513572
               B    1.057075
dtype: float64

In [77]:
stacked.unstack()

                     A         B
first second
bar   one     0.525065  0.463145
      two     0.077393 -0.925633
baz   one     0.204906  1.746510
      two    -0.779591  1.391270
foo   one    -0.173879 -1.757532
      two    -0.920432  0.926281
qux   one    -2.034043  0.168328
      two     0.513572  1.057075

### 透视表

In [79]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3, 'B' : ['A', 'B', 'C'] * 4,'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2, 'D' : np.random.randn(12), 'E' : np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo -0.307943  0.652500
1     one  B  foo  0.901147  0.830972
2     two  C  foo  0.290547  0.100251
3   three  A  bar -1.639197 -0.499870
4     one  B  bar  0.816268  0.707717
5     one  C  bar -0.967429 -0.834206
6     two  A  foo -1.263881  1.376381
7   three  B  foo -0.283463 -0.207656
8     one  C  foo  0.532412 -0.019059
9     one  A  bar  0.201987 -0.792878
10    two  B  bar  0.708149 -1.271972
11  three  C  bar  1.060239 -1.492970

In [80]:
# 透视表的数据为df, 关注的值为D, 索引通过A和B, 行标识为C
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  0.201987 -0.307943
      B  0.816268  0.901147
      C -0.967429  0.532412
three A -1.639197       NaN
      B       NaN -0.283463
      C  1.060239       NaN
two   A       NaN -1.263881
      B  0.708149       NaN
      C       NaN  0.290547

In [84]:
#透视表可以指定方法
pd.pivot_table(df,values='D',index='A',columns='C').count()

C
bar    3
foo    3
dtype: int64

## 时间分析

In [88]:
rng = pd.date_range('1/1/2012', periods=100, freq='2S')    #100个时间数据, 频度为秒, 可以设置为2S, 5S等等
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)    #建立随机数, 从0-500之间, 次数为rng的长度, 即100次
ts.head()

2012-01-01 00:00:00    451
2012-01-01 00:00:02    327
2012-01-01 00:00:04    208
2012-01-01 00:00:06    445
2012-01-01 00:00:08    454
Freq: 2S, dtype: int32

In [90]:
ts.resample('1Min').sum()    #统计时间量, 1Min为每一分钟, 5Min为每5分钟

2012-01-01 00:00:00    8369
2012-01-01 00:01:00    7561
2012-01-01 00:02:00    6800
2012-01-01 00:03:00    1803
Freq: T, dtype: int32

In [102]:
ts.resample('1M').sum()    #M应为月

2012-01-31    24533
Freq: M, dtype: int32

In [105]:
date = pd.date_range('1/1/2019', periods= 100, freq='10D')
ts2 = pd.Series(np.random.randint(0, 500, len(date)), index=date)    #建立随机数, 从0-500之间, 次数为rng的长度, 即100次
ts2.head()

2019-01-01    267
2019-01-11    349
2019-01-21    282
2019-01-31    204
2019-02-10    342
Freq: 10D, dtype: int32

In [110]:
ts2.resample('1M').count()[:10]

2019-01-31    4
2019-02-28    2
2019-03-31    3
2019-04-30    3
2019-05-31    4
2019-06-30    3
2019-07-31    3
2019-08-31    3
2019-09-30    3
2019-10-31    3
Freq: M, dtype: int64

In [115]:
#可以自动事项时区的转换
ts_utc = ts2.tz_localize('UTC')
ts_utc.tz_convert('US/Eastern')[:5]

2018-12-31 19:00:00-05:00    267
2019-01-10 19:00:00-05:00    349
2019-01-20 19:00:00-05:00    282
2019-01-30 19:00:00-05:00    204
2019-02-09 19:00:00-05:00    342
Freq: 10D, dtype: int32

In [117]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')    #按月处理
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

2012-01-31   -0.224415
2012-02-29    0.185104
2012-03-31    0.969963
2012-04-30   -0.413953
2012-05-31    0.209373
Freq: M, dtype: float64

In [119]:
#这一命令的作用? 目前看只是转换成了月
ps = ts.to_period()
ps

2012-01   -0.224415
2012-02    0.185104
2012-03    0.969963
2012-04   -0.413953
2012-05    0.209373
Freq: M, dtype: float64

In [120]:
ps.to_timestamp()

2012-01-01   -0.224415
2012-02-01    0.185104
2012-03-01    0.969963
2012-04-01   -0.413953
2012-05-01    0.209373
Freq: MS, dtype: float64

In [123]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')     #Q是季度
ts = pd.Series(np.random.randn(len(prng)), prng) 
ts.head()

1990Q1    0.243886
1990Q2    0.970323
1990Q3    0.492042
1990Q4   -0.974996
1991Q1    0.628925
Freq: Q-NOV, dtype: float64

In [124]:
ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9
ts.head()

1990-03-01 09:00    0.243886
1990-06-01 09:00    0.970323
1990-09-01 09:00    0.492042
1990-12-01 09:00   -0.974996
1991-03-01 09:00    0.628925
Freq: H, dtype: float64

## 标签

In [127]:
#定义了一组分类数据
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [143]:
df["grade"] = df["raw_grade"].astype("category")
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [144]:
df

   id raw_grade grade
0   1         a     a
1   2         b     b
2   3         b     b
3   4         a     a
4   5         a     a
5   6         e     e

In [145]:
df['grade']

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [146]:
df["grade"].cat.categories = ["very good", "good", "very bad"]     #设置了对应的3个分类
#df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])
df['grade']

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (3, object): [very good, good, very bad]

In [148]:
#设置5个分类
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "vE good"])
df['grade']

0         NaN
1        good
2        good
3         NaN
4         NaN
5    very bad
Name: grade, dtype: category
Categories (5, object): [very bad, bad, medium, good, vE good]

可见,上文的已有分类并没有变化, 但是,扩展了新的分类.

如果在上文中, 设置了一个原先标签中没有的信息, 原先的标签就会被显示为: NaN

## 绘图

In [2]:
ts = pd.Series(np.random.randn(1000), index=pd.date_range('1/1/2000',periods=1000))
ts.plot()

## 输入输出

理解:
`read_csv`
和
`to_csv`
即可.